bin/BKUSignatureVerificationRequest.xml

<?xml version="1.0" encoding="UTF-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://reference.e-government.gv.at/namespace/moa/20020822#" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
<soapenv:Body>
<VerifyXMLSignatureRequest
	xmlns="http://reference.e-government.gv.at/namespace/moa/20020822#"
	xmlns:ns2="http://www.w3.org/2000/09/xmldsig#">
	<VerifySignatureInfo>
		<VerifySignatureEnvironment>
			<Base64Content>${data}</Base64Content>
		</VerifySignatureEnvironment>
		<VerifySignatureLocation xmlns:sl="http://www.buergerkarte.at/namespaces/securitylayer/1.2#"
			xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">/dsig:Signature</VerifySignatureLocation>
	</VerifySignatureInfo>
	<TrustProfileID>${trustProfile}</TrustProfileID>
</VerifyXMLSignatureRequest>
</soapenv:Body>
</soapenv:Envelope>
