packages/pybktools/pybktools-0.0.1.tar.gz/pybktools-0.0.1/pybktools/tmpl/MOA-SP-VerifySignatureRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">

<soapenv:Body>
<moa:VerifyXMLSignatureRequest 
      xmlns:dsig="http://www.w3.org/2000/09/xmldsig#" 
      xmlns:moa="http://reference.e-government.gv.at/namespace/moa/20020822#">
    <moa:VerifySignatureInfo>
        <moa:VerifySignatureEnvironment>
            <moa:XMLContent>

REPLACE_WITH_SIGNED_XML_DATA

            </moa:XMLContent>
        </moa:VerifySignatureEnvironment>
        <moa:VerifySignatureLocation>/dsig:Signature</moa:VerifySignatureLocation>
    </moa:VerifySignatureInfo>
    <moa:ReturnHashInputData/>
    <moa:TrustProfileID>SecureSignature</moa:TrustProfileID>
</moa:VerifyXMLSignatureRequest>
</soapenv:Body>
</soapenv:Envelope>
